Revit 2026 API

# AnalysisDisplayMarkersAndTextSettings Properties

---

The AnalysisDisplayMarkersAndTextSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MarkerSize | Size of marker. |
|  | MarkerType | Type of marker. |
|  | Rounding | Increment to which numeric values of analysis results are rounded in markers. |
|  | TextLabelType | Type of diagram text label visualization. |
|  | TextTypeId | Element id of text associated with the settings. |

#### Reference

AnalysisDisplayMarkersAndTextSettings Class

Autodesk.Revit.DB.Analysis Namespace